# For CustomerDemographic

In [1]:
# importing libraries
import numpy as np
import scipy.stats as stats
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# reading the excel datasets
xls = pd.ExcelFile("D:/KPMG virtual intership/KPMG_VI_New_raw_data_update_final.xlsx")
pd1 = pd.read_excel(xls, sheet_name=3, header=1)

In [3]:
df1 = pd.DataFrame(pd1)

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 26 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
 13  Unnamed: 13                          0 non-null      float64
 14  Unnamed: 14                          0 non-null      float64
 15  Unnamed: 15                          0 non-null      float64
 16  Unnamed: 16                          0 non-null      float64
 17  Unnamed: 17                          0 non-null      float64
 18  Unnamed: 18                          0 non-null      float64
 19  Unnamed: 19                          0 non-null      float64
 20  Unnamed: 20                          0 non-null      float64
 21  Unnamed: 21                          0 non-null      float64
 22  Unnamed: 22                          0 non-null      float64
 23  Unnamed: 23                          0 non-null      float64
 24  Unnamed: 24                          0 non-null      float64
 25  Unnamed: 25                          0 non-null      float64
dtypes: datetime64[ns](1), float64(14), int64(2), object(9)
memory usage: 812.6+ KB

In [5]:
# checking the first 5 records
df1.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
# checking the shape
df1.shape

(4000, 26)

In [7]:
# checking for null values
df1.isnull().sum()

customer_id                               0
first_name                                0
last_name                               125
gender                                    0
past_3_years_bike_related_purchases       0
DOB                                      87
job_title                               506
job_industry_category                   656
wealth_segment                            0
deceased_indicator                        0
default                                 302
owns_car                                  0
tenure                                   87
Unnamed: 13                            4000
Unnamed: 14                            4000
Unnamed: 15                            4000
Unnamed: 16                            4000
Unnamed: 17                            4000
Unnamed: 18                            4000
Unnamed: 19                            4000
Unnamed: 20                            4000
Unnamed: 21                            4000
Unnamed: 22                            4000
Unnamed: 23                            4000
Unnamed: 24                            4000
Unnamed: 25                            4000
dtype: int64

In [8]:
# dropping the unnamed columns for the dataset to be usable
df1.drop(["Unnamed: 13", "Unnamed: 14", "Unnamed: 15", "Unnamed: 16", "Unnamed: 17", "Unnamed: 18", "Unnamed: 19", "Unnamed: 20",
         "Unnamed: 21", "Unnamed: 22", "Unnamed: 23", "Unnamed: 24", "Unnamed: 25"], axis=1, inplace=True)

In [9]:
df1.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [10]:
# percentage of missing values
df1.isnull().sum()/len(df1)*100

customer_id                             0.000
first_name                              0.000
last_name                               3.125
gender                                  0.000
past_3_years_bike_related_purchases     0.000
DOB                                     2.175
job_title                              12.650
job_industry_category                  16.400
wealth_segment                          0.000
deceased_indicator                      0.000
default                                 7.550
owns_car                                0.000
tenure                                  2.175
dtype: float64

In [11]:
# dropping the column if too many datapoint is missing to be usable
drop_threshold = df1.shape[0]*0.5
df1 = df1.dropna(thresh = drop_threshold, how="all", axis="columns").copy()

In [12]:
df1.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [13]:
# sanity check for duplicate data
column_names = df1.columns

for i in column_names:
    print((i, df1[i].is_unique))

('customer_id', True)
('first_name', False)
('last_name', False)
('gender', False)
('past_3_years_bike_related_purchases', False)
('DOB', False)
('job_title', False)
('job_industry_category', False)
('wealth_segment', False)
('deceased_indicator', False)
('default', False)
('owns_car', False)
('tenure', False)

In [14]:
# dropping the column with corrupted data
del df1["default"]

In [15]:
# making sure that the I donly contains legitimate digits
df1["customer_id"] = df1["customer_id"].astype("int")

In [16]:
# making sure that gender is a category
df1["gender"] = df1["gender"].astype("category")

In [17]:
# checking teh entered data for gender
df1["gender"].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [18]:
# replacing all misspelt of differently formatted data
df1["gender"].replace({"M":"Male", "F":"Female", "Femal":"Female"}, inplace=True)

In [19]:
# checking the frequency of different job titles
df1["job_title"].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Database Administrator I                 4
Research Assistant III                   3
Health Coach III                         3
Health Coach I                           3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [20]:
# filling the missing datapoint using the backward fill method
df1["job_title"] = df1["job_title"].fillna(method="bfill")

In [21]:
# checking the frequencies of job industries
df1["job_industry_category"].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [22]:
# filling the missing datapoint using the forward fill method
df1["job_industry_category"] = df1["job_industry_category"].fillna(method="ffill")

In [23]:
# making sure all dates are in date format
df1["DOB"] = df1["DOB"].dt.date

In [26]:
# convert to boolean data type
f = {'N': False, 'Y': True}
df1['deceased_indicator'] = df1['deceased_indicator'].map(f).fillna(df1['deceased_indicator'])

In [27]:
# convert to boolean data type
g = {'No': False, 'Yes': True}
df1['owns_car'] = df1['owns_car'].map(g).fillna(df1['owns_car'])

In [28]:
# calculating the median value for tenure
df1["tenure"].median()

11.0

In [29]:
# filling the missing values for tenure
df1["tenure"] = df1["tenure"].fillna(df1["tenure"].median())

In [30]:
# making sure the column names are in correct format
df1.columns = map(str.lower, df1.columns)
df1.columns = map(str.strip, df1.columns)

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int32
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   dob                                  3913 non-null   object
 6   job_title                            4000 non-null   object
 7   job_industry_category                4000 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   bool
 10  owns_car                             4000 non-null   bool
 11  tenure                               4000 non-null   float64
dtypes: bool(2), float64(1), int32(1), int64(1), object(7)
memory usage: 304.8+ KB

In [32]:
df1.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,False,True,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,False,True,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,False,True,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,Senior Editor,IT,Mass Customer,False,False,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,IT,Affluent Customer,False,True,8.0

In [33]:
# print to csv file after cleaning 
df1.to_csv("D:/KPMG virtual intership/CustomerDempgraphic_cleaned.csv", index=False)

# For Customer Address

In [34]:
pd2 = pd.read_excel(xls, sheet_name=4, header=1)

In [35]:
df2 = pd.DataFrame(pd2)

In [36]:
# information of the data
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 26 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
 6   Unnamed: 6          0 non-null      float64
 7   Unnamed: 7          0 non-null      float64
 8   Unnamed: 8          0 non-null      float64
 9   Unnamed: 9          0 non-null      float64
 10  Unnamed: 10         0 non-null      float64
 11  Unnamed: 11         0 non-null      float64
 12  Unnamed: 12         0 non-null      float64
 13  Unnamed: 13         0 non-null      float64
 14  Unnamed: 14         0 non-null      float64
 15  Unnamed: 15         0 non-null      float64
 16  Unnamed: 16         0 non-null      float64
 17  Unnamed: 17         0 non-null      float64
 18  Unnamed: 18         0 non-null      float64
 19  Unnamed: 19         0 non-null      float64
 20  Unnamed: 20         0 non-null      float64
 21  Unnamed: 21         0 non-null      float64
 22  Unnamed: 22         0 non-null      float64
 23  Unnamed: 23         0 non-null      float64
 24  Unnamed: 24         0 non-null      float64
 25  Unnamed: 25         0 non-null      float64
dtypes: float64(20), int64(3), object(3)
memory usage: 812.4+ KB

In [37]:
cols = df2.columns[0:6]
df2 = df2[cols]
df2.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [38]:
# checking for null values
df2.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [39]:
# checking is customer id is unique
df2["customer_id"].is_unique

True

In [40]:
# checking for duplicate properties
df2.duplicated(subset = ["address", "postcode"], keep="first").value_counts()

False    3999
dtype: int64

In [41]:
# checking frequency of different postcodes
df2['postcode'].value_counts()

2170    31
2145    30
2155    30
2153    29
3977    26
        ..
3331     1
3036     1
3321     1
3305     1
2143     1
Name: postcode, Length: 873, dtype: int64

In [42]:
# checking the frequency of different states
df2["state"].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [43]:
# replacing all the misspelt or differently formatted data
df2["state"].replace({"New south Wales":"NSW", "Victoria":"VIC"}, inplace=True)

In [44]:
# showing the frequency of teh country to which the property belong to
df2["country"].value_counts()

Australia    3999
Name: country, dtype: int64

In [45]:
# checking that the column names are in the correct format
df2.columns = map(str.lower, df2.columns)
df2.columns = map(str.strip, df2.columns)

In [46]:
df2.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [47]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [48]:
# print to csv file after cleaning 
df1.to_csv("D:/KPMG virtual intership/CustomerAddress_cleaned.csv", index=False)

# For Transactions

In [49]:
pd3 = pd.read_excel(xls, sheet_name=1, header=1)

In [50]:
df3 = pd.DataFrame(pd3)

In [51]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 26 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
 13  Unnamed: 13              0 non-null      float64
 14  Unnamed: 14              0 non-null      float64
 15  Unnamed: 15              0 non-null      float64
 16  Unnamed: 16              0 non-null      float64
 17  Unnamed: 17              0 non-null      float64
 18  Unnamed: 18              0 non-null      float64
 19  Unnamed: 19              0 non-null      float64
 20  Unnamed: 20              0 non-null      float64
 21  Unnamed: 21              0 non-null      float64
 22  Unnamed: 22              0 non-null      float64
 23  Unnamed: 23              0 non-null      float64
 24  Unnamed: 24              0 non-null      float64
 25  Unnamed: 25              0 non-null      float64
dtypes: datetime64[ns](1), float64(17), int64(3), object(5)
memory usage: 4.0+ MB

In [52]:
cols = df3.columns[0:13]
df3 = df3[cols]
df3.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [53]:
df3.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [54]:
# percentage of missing values
df3.isnull().sum()/len(df3) *100

transaction_id             0.000
product_id                 0.000
customer_id                0.000
transaction_date           0.000
online_order               1.800
order_status               0.000
brand                      0.985
product_line               0.985
product_class              0.985
product_size               0.985
list_price                 0.000
standard_cost              0.985
product_first_sold_date    0.985
dtype: float64

In [55]:
# sorting the columns by customer id and transaction date
df3 = df3.sort_values(["customer_id", "transaction_date"])

In [56]:
# counting the number of online order or otherwise
df3["online_order"].value_counts()

1.0    9829
0.0    9811
Name: online_order, dtype: int64

In [57]:
# filling the missing data using back-fill method
df3['online_order'] = df3['online_order'].fillna(method='bfill')

In [58]:
# counting the number of different brands
df3["brand"].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [59]:
# filling the missing data with forward fill method
df3['brand'] = df3['brand'].fillna(method='ffill')

In [60]:
# counting the number of different product lines
df3['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [61]:
# filling teh missing values using back-fill method
df3['product_line'] = df3['product_line'].fillna(method='bfill')

In [62]:
# counting the number of different product classes
df3['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [63]:
# fill the missing data using the back-fill method
df3['product_class'] = df3['product_class'].fillna(method='bfill')

In [64]:
# counting the product sizes
df3['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [65]:
# fill the missing data using the forward-fill method
df3['product_size'] = df3['product_size'].fillna(method='ffill')

In [66]:
# working out the average cost for each customer
customerStandardCost = df3.groupby(["customer_id"]).mean().round(decimals=2)
customerStandardCost

,transaction_id,product_id,online_order,list_price,standard_cost,product_first_sold_date
customer_id,,,,,,
1,11485.64,34.18,0.55,825.86,551.49,37314.09
2,8471.67,37.33,0.33,1383.02,640.94,38775.67
3,13842.62,60.38,0.12,1236.03,815.68,39350.25
4,13544.50,78.50,0.50,523.86,413.58,36008.50
5,7969.67,48.17,0.33,983.87,584.71,37361.00
...,...,...,...,...,...,...
3497,8565.00,32.33,0.67,1248.02,698.58,38680.33
3498,9327.50,72.17,0.83,862.84,338.29,37723.67
3499,6871.29,42.71,0.57,1096.21,388.32,38163.86
3500,10076.00,40.00,0.33,820.40,522.76,36432.50
5034,14292.67,0.00,0.00,506.64,416.81,37254.67

In [67]:
# filling in the missing data with teh average cost for that customer
df3["standard_cost"] = df3["standard_cost"].fillna(customerStandardCost["standard_cost"])

In [68]:
# filling in the missing data with the average first sold date
df3["product_first_sold_date"] = df3["product_first_sold_date"].fillna(df3["product_first_sold_date"].mean())

In [69]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20000 entries, 9784 to 8707
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             20000 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    20000 non-null  object
 7   product_line             20000 non-null  object
 8   product_class            20000 non-null  object
 9   product_size             20000 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19824 non-null  float64
 12  product_first_sold_date  20000 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.1+ MB

In [70]:
# print to csv file after cleaning 
df1.to_csv("D:/KPMG virtual intership/Transactions_cleaned.csv", index=False)

# For NewCustomerList

In [71]:
pd4 = pd.read_excel(xls, sheet_name=2, header=1)

In [72]:
df4 = pd.DataFrame(pd4)

In [73]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [74]:
# dropping the unnamed columns
df4.drop(["Unnamed: 16", "Unnamed: 17", "Unnamed: 18", "Unnamed: 19", "Unnamed: 20"], axis=1, inplace=True)

In [75]:
df4.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [76]:
df4.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [77]:
# sorting by first_name, and then filling that last name
df4["last_name"] = df4.groupby("first_name").last_name.bfill().ffill()

In [78]:
# checking teh gender count
df4['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [79]:
# checking state count
df4['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [80]:
# checking the country count
df4['country'].value_counts()

Australia    1000
Name: country, dtype: int64

In [81]:
# checking for unique address
df4['address'].nunique()

1000

In [82]:
# making sure all the dates are in correct format
df4['DOB'] = df4['DOB'].dt.date
df4['DOB']

0      1957-07-12
1      1970-03-22
2      1974-08-28
3      1979-01-28
4      1965-09-21
          ...
995    1959-10-07
996    2001-10-17
997    1954-10-05
998    1952-12-17
999    1955-10-02
Name: DOB, Length: 1000, dtype: object

In [83]:
# filling the missing data of birth with a random choice of date from teh existing dates
df4["DOB"].fillna(lambda x: np.random.choice(df4["DOB"]), inplace=True)

In [84]:
# checking teh different job frequency
df4["job_title"].value_counts()

Associate Professor              15
Software Consultant              14
Environmental Tech               14
Chief Design Engineer            13
VP Sales                         12
                                 ..
Account Representative II         1
Human Resources Assistant III     1
Software Test Engineer II         1
Health Coach I                    1
Media Manager I                   1
Name: job_title, Length: 184, dtype: int64

In [85]:
# fill the missing datapoint using the backward filling method
df4['job_title']= df4['job_title'].fillna(method='bfill')

In [86]:
# checking the frequency of job industries
df4['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [87]:
# fill the missing datapoint using the forward filling method
df4['job_industry_category']= df4['job_industry_category'].fillna(method='ffill')

In [88]:
# make sure that the column names are in the correct format
df4.columns = map(str.lower, df4.columns)
df4.columns = map(str.strip, df4.columns)

In [89]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            1000 non-null   object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   dob                                  1000 non-null   object
 5   job_title                            1000 non-null   object
 6   job_industry_category                1000 non-null   object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  rank                                 1000 non-null   int64
 17  value                                1000 non-null   float64
dtypes: float64(1), int64(5), object(12)
memory usage: 140.8+ KB

In [90]:
# print to csv file after cleaning 
df1.to_csv("D:/KPMG virtual intership/NewCustomerList_cleaned.csv", index=False)